Public Attributes | List of all members
API_PerspCamPars Struct Reference
Element Manager API
Parameters of a perspective camera. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_PerspPars  | persp
Perspective projection settings of the camera.
short  | waitFrames
Number of the frames to wait here.
short  | pen
Pen attribute index for the camera.
API_Guid  | prevCam
Guid of the previous camera in the same camera set (APINULLGuid if no previous camera).
API_Guid  | nextCam
Guid of the following camera in the same camera set (APINULLGuid if no following camera).
double  | lenPrev
Bezier direction length previous.
double  | lenNext
Bezier direction length next.
double  | dirAng
Bezier direction angle (radian).
bool  | active
Active in the path?
Detailed Description
Parameters of a perspective camera.
Member Data Documentation
◆ active
 API_PerspCamPars::active
Active in the path?
◆ dirAng
 API_PerspCamPars::dirAng
Bezier direction angle (radian).
◆ lenNext
 API_PerspCamPars::lenNext
Bezier direction length next.
◆ lenPrev
 API_PerspCamPars::lenPrev
Bezier direction length previous.
◆ nextCam
 API_PerspCamPars::nextCam
Guid of the following camera in the same camera set (APINULLGuid if no following camera).
◆ pen
 API_PerspCamPars::pen
Pen attribute index for the camera.
◆ persp
 API_PerspCamPars::persp
Perspective projection settings of the camera.
◆ prevCam
 API_PerspCamPars::prevCam
Guid of the previous camera in the same camera set (APINULLGuid if no previous camera).
◆ waitFrames
 API_PerspCamPars::waitFrames
Number of the frames to wait here.